app/controllers/charts_controller.rb

SELECT "charts".* FROM "charts" WHERE ("charts"."seat" IS NULL) LIMIT 1
UPDATE "charts" SET "user_id" = 30, "updated_at" = '2011-04-02 06:31:11.294972' WHERE ("charts"."id" = 4)
SELECT "charts".* FROM "charts" WHERE ("charts"."id" = 28) LIMIT 1
SELECT "charts"."id" FROM "charts" WHERE ("charts"."user_id" IS NULL) AND ("charts"."user_id" IS NULL) AND ("charts"."seat" = 3) AND ("charts".id <> 3) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."user_id" = 30) LIMIT 1
SELECT "chats".* FROM "chats" WHERE (created_at >= '2011-04-04 02:40:24.378876') AND ("chats"."username" = 'test29') LIMIT 1
---
  def index
    #Find a seat that someone clicked on in the chart
    #only if they are logged in
    if params[:id] != nil && session[:user_id] != nil
         @seat = Chart.first(:conditions => {:seat=>params[:id]})

         # Check that the seat is empty
         if @seat.user_id == nil && @seat.id != nil
	     # The seat is empty, add this user to it
            # but first remove the user from any other seat
            Chart.update_all({:user_id => nil}, {:user_id => session[:user_id]})
            Chart.update(params[:id], {:user_id => session[:user_id]})

            # Display success message
            flash.now[:success] = "You are now sitting in seat #{params[:id]}!"
         elsif @seat.user_id == session[:user_id]
            # The user is already is that seat, so remove them
            Chart.update(params[:id], {:user_id => nil})
            flash.now[:success] = "You are no longer sitting in seat #{params[:id]}!"
         else
            # Display error message, seat taken
            flash.now[:error] = "Sorry, but that seat is currently occupied."
         end
    end

    # Get all seats in the chart
    @charts = Chart.find(:all, :order => "seat ASC")
    @charts.each_with_index do |seat, index|
	if seat.user_id != nil
		@charts[index].username = User.first(:conditions => {:id=>seat.user_id}).username

		@chats = Chat.find_by_username(@charts[index].username, :conditions => ["created_at >= ?", Time.now().utc - 5.minutes])

SELECT "charts".* FROM "charts" WHERE ("charts"."id" = 1) LIMIT 1
---
  def show
    @chart = Chart.find(params[:id])

INSERT INTO "charts" ("user_id", "seat", "created_at", "updated_at") VALUES (NULL, 2, '2011-03-24 06:55:08.452702', '2011-03-24 06:55:08.452702')
---
  def create
    @chart = Chart.new(params[:chart])

    respond_to do |format|
      if @chart.save