app/controllers/chats_controller.rb

  def index
    @chats = Chat.all.last(60)
---
SELECT "chats".* FROM "chats"

  def create
    @chat = Chat.new(params[:chat])
      if @chat.save
---
INSERT INTO "chats" ("username", "message", "created_at", "updated_at") VALUES ('yang', 'test', '2011-04-03 02:03:32.224499', '2011-04-03 02:03:32.224499')